src/Catalogs/СписокТоваровИУслуг/СписокТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокТоваровИУслуг</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>Склад</name>
    <type>
      <types>EnumRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>Кладовщик</name>
    <type>
      <types>CatalogRef.СписокСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПриема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СписокТоваровИУслуг/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.СписокТоваровИУслуг.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокТоваровИУслуг.ВремяПриема,
	|	СписокТоваровИУслуг.Кладовщик,
	|	СписокТоваровИУслуг.Код,
	|	СписокТоваровИУслуг.Наименование,
	|	СписокТоваровИУслуг.Склад
	|ИЗ
	|	Справочник.СписокТоваровИУслуг КАК СписокТоваровИУслуг
	|ГДЕ
	|	СписокТоваровИУслуг.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
